SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_i2c.h
/* Bit fields for I2C CMD */
#define _I2C_CMD_RESETVALUE                     0x00000000UL                            /**< Default value for I2C_CMD                   */
#define _I2C_CMD_MASK                           0x000000FFUL                            /**< Mask for I2C_CMD                            */
#define I2C_CMD_START                           (0x1UL << 0)                            /**< Send start condition                        */
#define _I2C_CMD_START_SHIFT                    0                                       /**< Shift value for I2C_START                   */
#define _I2C_CMD_START_MASK                     0x1UL                                   /**< Bit mask for I2C_START                      */
#define _I2C_CMD_START_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for I2C_CMD                    */
#define I2C_CMD_START_DEFAULT                   (_I2C_CMD_START_DEFAULT << 0)           /**< Shifted mode DEFAULT for I2C_CMD            */
#define I2C_CMD_STOP                            (0x1UL << 1)                            /**< Send stop condition                         */
#define _I2C_CMD_STOP_SHIFT                     1                                       /**< Shift value for I2C_STOP                    */
#define _I2C_CMD_STOP_MASK                      0x2UL                                   /**< Bit mask for I2C_STOP                       */
#define _I2C_CMD_STOP_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for I2C_CMD                    */
#define I2C_CMD_STOP_DEFAULT                    (_I2C_CMD_STOP_DEFAULT << 1)            /**< Shifted mode DEFAULT for I2C_CMD            */
#define I2C_CMD_ACK                             (0x1UL << 2)                            /**< Send ACK                                    */
#define _I2C_CMD_ACK_SHIFT                      2                                       /**< Shift value for I2C_ACK                     */
#define _I2C_CMD_ACK_MASK                       0x4UL                                   /**< Bit mask for I2C_ACK                        */
#define _I2C_CMD_ACK_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for I2C_CMD                    */
#define I2C_CMD_ACK_DEFAULT                     (_I2C_CMD_ACK_DEFAULT << 2)             /**< Shifted mode DEFAULT for I2C_CMD            */
#define I2C_CMD_NACK                            (0x1UL << 3)                            /**< Send NACK                                   */
#define _I2C_CMD_NACK_SHIFT                     3                                       /**< Shift value for I2C_NACK                    */
#define _I2C_CMD_NACK_MASK                      0x8UL                                   /**< Bit mask for I2C_NACK                       */
#define _I2C_CMD_NACK_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for I2C_CMD                    */
#define I2C_CMD_NACK_DEFAULT                    (_I2C_CMD_NACK_DEFAULT << 3)            /**< Shifted mode DEFAULT for I2C_CMD            */
#define I2C_CMD_CONT                            (0x1UL << 4)                            /**< Continue transmission                       */
#define _I2C_CMD_CONT_SHIFT                     4                                       /**< Shift value for I2C_CONT                    */
#define _I2C_CMD_CONT_MASK                      0x10UL                                  /**< Bit mask for I2C_CONT                       */
#define _I2C_CMD_CONT_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for I2C_CMD                    */
#define I2C_CMD_CONT_DEFAULT                    (_I2C_CMD_CONT_DEFAULT << 4)            /**< Shifted mode DEFAULT for I2C_CMD            */
#define I2C_CMD_ABORT                           (0x1UL << 5)                            /**< Abort transmission                          */
#define _I2C_CMD_ABORT_SHIFT                    5                                       /**< Shift value for I2C_ABORT                   */
#define _I2C_CMD_ABORT_MASK                     0x20UL                                  /**< Bit mask for I2C_ABORT                      */
#define _I2C_CMD_ABORT_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for I2C_CMD                    */
#define I2C_CMD_ABORT_DEFAULT                   (_I2C_CMD_ABORT_DEFAULT << 5)           /**< Shifted mode DEFAULT for I2C_CMD            */
#define I2C_CMD_CLEARTX                         (0x1UL << 6)                            /**< Clear TX                                    */
#define _I2C_CMD_CLEARTX_SHIFT                  6                                       /**< Shift value for I2C_CLEARTX                 */
#define _I2C_CMD_CLEARTX_MASK                   0x40UL                                  /**< Bit mask for I2C_CLEARTX                    */
#define _I2C_CMD_CLEARTX_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for I2C_CMD                    */
#define I2C_CMD_CLEARTX_DEFAULT                 (_I2C_CMD_CLEARTX_DEFAULT << 6)         /**< Shifted mode DEFAULT for I2C_CMD            */
#define I2C_CMD_CLEARPC                         (0x1UL << 7)                            /**< Clear Pending Commands                      */
#define _I2C_CMD_CLEARPC_SHIFT                  7                                       /**< Shift value for I2C_CLEARPC                 */
#define _I2C_CMD_CLEARPC_MASK                   0x80UL                                  /**< Bit mask for I2C_CLEARPC                    */
#define _I2C_CMD_CLEARPC_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for I2C_CMD                    */
#define I2C_CMD_CLEARPC_DEFAULT                 (_I2C_CMD_CLEARPC_DEFAULT << 7)         /**< Shifted mode DEFAULT for I2C_CMD            */

/* Bit fields for I2C STATE */
#define _I2C_STATE_RESETVALUE                   0x00000001UL                            /**< Default value for I2C_STATE                 */
#define _I2C_STATE_MASK                         0x000000FFUL                            /**< Mask for I2C_STATE                          */
#define I2C_STATE_BUSY                          (0x1UL << 0)                            /**< Bus Busy                                    */
#define _I2C_STATE_BUSY_SHIFT                   0                                       /**< Shift value for I2C_BUSY                    */
#define _I2C_STATE_BUSY_MASK                    0x1UL                                   /**< Bit mask for I2C_BUSY                       */
#define _I2C_STATE_BUSY_DEFAULT                 0x00000001UL                            /**< Mode DEFAULT for I2C_STATE                  */
#define I2C_STATE_BUSY_DEFAULT                  (_I2C_STATE_BUSY_DEFAULT << 0)          /**< Shifted mode DEFAULT for I2C_STATE          */
#define I2C_STATE_MASTER                        (0x1UL << 1)                            /**< Leader                                      */
#define _I2C_STATE_MASTER_SHIFT                 1                                       /**< Shift value for I2C_MASTER                  */
#define _I2C_STATE_MASTER_MASK                  0x2UL                                   /**< Bit mask for I2C_MASTER                     */
#define _I2C_STATE_MASTER_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for I2C_STATE                  */
#define I2C_STATE_MASTER_DEFAULT                (_I2C_STATE_MASTER_DEFAULT << 1)        /**< Shifted mode DEFAULT for I2C_STATE          */
#define I2C_STATE_TRANSMITTER                   (0x1UL << 2)                            /**< Transmitter                                 */
#define _I2C_STATE_TRANSMITTER_SHIFT            2                                       /**< Shift value for I2C_TRANSMITTER             */
#define _I2C_STATE_TRANSMITTER_MASK             0x4UL                                   /**< Bit mask for I2C_TRANSMITTER                */
#define _I2C_STATE_TRANSMITTER_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for I2C_STATE                  */
#define I2C_STATE_TRANSMITTER_DEFAULT           (_I2C_STATE_TRANSMITTER_DEFAULT << 2)   /**< Shifted mode DEFAULT for I2C_STATE          */
#define I2C_STATE_NACKED                        (0x1UL << 3)                            /**< Nack Received                               */
#define _I2C_STATE_NACKED_SHIFT                 3                                       /**< Shift value for I2C_NACKED                  */
#define _I2C_STATE_NACKED_MASK                  0x8UL                                   /**< Bit mask for I2C_NACKED                     */
#define _I2C_STATE_NACKED_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for I2C_STATE                  */
#define I2C_STATE_NACKED_DEFAULT                (_I2C_STATE_NACKED_DEFAULT << 3)        /**< Shifted mode DEFAULT for I2C_STATE          */
#define I2C_STATE_BUSHOLD                       (0x1UL << 4)                            /**< Bus Held                                    */
#define _I2C_STATE_BUSHOLD_SHIFT                4                                       /**< Shift value for I2C_BUSHOLD                 */
#define _I2C_STATE_BUSHOLD_MASK                 0x10UL                                  /**< Bit mask for I2C_BUSHOLD                    */
#define _I2C_STATE_BUSHOLD_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for I2C_STATE                  */
#define I2C_STATE_BUSHOLD_DEFAULT               (_I2C_STATE_BUSHOLD_DEFAULT << 4)       /**< Shifted mode DEFAULT for I2C_STATE          */
#define _I2C_STATE_STATE_SHIFT                  5                                       /**< Shift value for I2C_STATE                   */
#define _I2C_STATE_STATE_MASK                   0xE0UL                                  /**< Bit mask for I2C_STATE                      */
#define _I2C_STATE_STATE_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for I2C_STATE                  */
#define _I2C_STATE_STATE_IDLE                   0x00000000UL                            /**< Mode IDLE for I2C_STATE                     */
#define _I2C_STATE_STATE_WAIT                   0x00000001UL                            /**< Mode WAIT for I2C_STATE                     */
#define _I2C_STATE_STATE_START                  0x00000002UL                            /**< Mode START for I2C_STATE                    */
#define _I2C_STATE_STATE_ADDR                   0x00000003UL                            /**< Mode ADDR for I2C_STATE                     */
#define _I2C_STATE_STATE_ADDRACK                0x00000004UL                            /**< Mode ADDRACK for I2C_STATE                  */
#define _I2C_STATE_STATE_DATA                   0x00000005UL                            /**< Mode DATA for I2C_STATE                     */
#define _I2C_STATE_STATE_DATAACK                0x00000006UL                            /**< Mode DATAACK for I2C_STATE                  */
#define I2C_STATE_STATE_DEFAULT                 (_I2C_STATE_STATE_DEFAULT << 5)         /**< Shifted mode DEFAULT for I2C_STATE          */
#define I2C_STATE_STATE_IDLE                    (_I2C_STATE_STATE_IDLE << 5)            /**< Shifted mode IDLE for I2C_STATE             */
#define I2C_STATE_STATE_WAIT                    (_I2C_STATE_STATE_WAIT << 5)            /**< Shifted mode WAIT for I2C_STATE             */
#define I2C_STATE_STATE_START                   (_I2C_STATE_STATE_START << 5)           /**< Shifted mode START for I2C_STATE            */
#define I2C_STATE_STATE_ADDR                    (_I2C_STATE_STATE_ADDR << 5)            /**< Shifted mode ADDR for I2C_STATE             */
#define I2C_STATE_STATE_ADDRACK                 (_I2C_STATE_STATE_ADDRACK << 5)         /**< Shifted mode ADDRACK for I2C_STATE          */
#define I2C_STATE_STATE_DATA                    (_I2C_STATE_STATE_DATA << 5)            /**< Shifted mode DATA for I2C_STATE             */
#define I2C_STATE_STATE_DATAACK                 (_I2C_STATE_STATE_DATAACK << 5)         /**< Shifted mode DATAACK for I2C_STATE          */

/* Bit fields for I2C STATUS */
#define _I2C_STATUS_RESETVALUE                  0x00000080UL                            /**< Default value for I2C_STATUS                */
#define _I2C_STATUS_MASK                        0x00000FFFUL                            /**< Mask for I2C_STATUS                         */
#define I2C_STATUS_PSTART                       (0x1UL << 0)                            /**< Pending START                               */
#define _I2C_STATUS_PSTART_SHIFT                0                                       /**< Shift value for I2C_PSTART                  */
#define _I2C_STATUS_PSTART_MASK                 0x1UL                                   /**< Bit mask for I2C_PSTART                     */
#define _I2C_STATUS_PSTART_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for I2C_STATUS                 */
#define I2C_STATUS_PSTART_DEFAULT               (_I2C_STATUS_PSTART_DEFAULT << 0)       /**< Shifted mode DEFAULT for I2C_STATUS         */
#define I2C_STATUS_PSTOP                        (0x1UL << 1)                            /**< Pending STOP                                */
#define _I2C_STATUS_PSTOP_SHIFT                 1                                       /**< Shift value for I2C_PSTOP                   */
#define _I2C_STATUS_PSTOP_MASK                  0x2UL                                   /**< Bit mask for I2C_PSTOP                      */
#define _I2C_STATUS_PSTOP_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for I2C_STATUS                 */
#define I2C_STATUS_PSTOP_DEFAULT                (_I2C_STATUS_PSTOP_DEFAULT << 1)        /**< Shifted mode DEFAULT for I2C_STATUS         */
#define I2C_STATUS_PACK                         (0x1UL << 2)                            /**< Pending ACK                                 */
#define _I2C_STATUS_PACK_SHIFT                  2                                       /**< Shift value for I2C_PACK                    */
#define _I2C_STATUS_PACK_MASK                   0x4UL                                   /**< Bit mask for I2C_PACK                       */
#define _I2C_STATUS_PACK_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for I2C_STATUS                 */
#define I2C_STATUS_PACK_DEFAULT                 (_I2C_STATUS_PACK_DEFAULT << 2)         /**< Shifted mode DEFAULT for I2C_STATUS         */
#define I2C_STATUS_PNACK                        (0x1UL << 3)                            /**< Pending NACK                                */
#define _I2C_STATUS_PNACK_SHIFT                 3                                       /**< Shift value for I2C_PNACK                   */
#define _I2C_STATUS_PNACK_MASK                  0x8UL                                   /**< Bit mask for I2C_PNACK                      */
#define _I2C_STATUS_PNACK_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for I2C_STATUS                 */
#define I2C_STATUS_PNACK_DEFAULT                (_I2C_STATUS_PNACK_DEFAULT << 3)        /**< Shifted mode DEFAULT for I2C_STATUS         */
#define I2C_STATUS_PCONT                        (0x1UL << 4)                            /**< Pending continue                            */
#define _I2C_STATUS_PCONT_SHIFT                 4                                       /**< Shift value for I2C_PCONT                   */
#define _I2C_STATUS_PCONT_MASK                  0x10UL                                  /**< Bit mask for I2C_PCONT                      */
#define _I2C_STATUS_PCONT_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for I2C_STATUS                 */
#define I2C_STATUS_PCONT_DEFAULT                (_I2C_STATUS_PCONT_DEFAULT << 4)        /**< Shifted mode DEFAULT for I2C_STATUS         */
#define I2C_STATUS_PABORT                       (0x1UL << 5)                            /**< Pending abort                               */
#define _I2C_STATUS_PABORT_SHIFT                5                                       /**< Shift value for I2C_PABORT                  */
#define _I2C_STATUS_PABORT_MASK                 0x20UL                                  /**< Bit mask for I2C_PABORT                     */
#define _I2C_STATUS_PABORT_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for I2C_STATUS                 */
#define I2C_STATUS_PABORT_DEFAULT               (_I2C_STATUS_PABORT_DEFAULT << 5)       /**< Shifted mode DEFAULT for I2C_STATUS         */
#define I2C_STATUS_TXC                          (0x1UL << 6)                            /**< TX Complete                                 */
#define _I2C_STATUS_TXC_SHIFT                   6                                       /**< Shift value for I2C_TXC                     */
#define _I2C_STATUS_TXC_MASK                    0x40UL                                  /**< Bit mask for I2C_TXC                        */
#define _I2C_STATUS_TXC_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for I2C_STATUS                 */
#define I2C_STATUS_TXC_DEFAULT                  (_I2C_STATUS_TXC_DEFAULT << 6)          /**< Shifted mode DEFAULT for I2C_STATUS         */
#define I2C_STATUS_TXBL                         (0x1UL << 7)                            /**< TX Buffer Level                             */
#define _I2C_STATUS_TXBL_SHIFT                  7                                       /**< Shift value for I2C_TXBL                    */
#define _I2C_STATUS_TXBL_MASK                   0x80UL                                  /**< Bit mask for I2C_TXBL                       */
#define _I2C_STATUS_TXBL_DEFAULT                0x00000001UL                            /**< Mode DEFAULT for I2C_STATUS                 */
#define I2C_STATUS_TXBL_DEFAULT                 (_I2C_STATUS_TXBL_DEFAULT << 7)         /**< Shifted mode DEFAULT for I2C_STATUS         */
#define I2C_STATUS_RXDATAV                      (0x1UL << 8)                            /**< RX Data Valid                               */
#define _I2C_STATUS_RXDATAV_SHIFT               8                                       /**< Shift value for I2C_RXDATAV                 */
#define _I2C_STATUS_RXDATAV_MASK                0x100UL                                 /**< Bit mask for I2C_RXDATAV                    */
#define _I2C_STATUS_RXDATAV_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for I2C_STATUS                 */
#define I2C_STATUS_RXDATAV_DEFAULT              (_I2C_STATUS_RXDATAV_DEFAULT << 8)      /**< Shifted mode DEFAULT for I2C_STATUS         */
#define I2C_STATUS_RXFULL                       (0x1UL << 9)                            /**< RX FIFO Full                                */
#define _I2C_STATUS_RXFULL_SHIFT                9                                       /**< Shift value for I2C_RXFULL                  */
#define _I2C_STATUS_RXFULL_MASK                 0x200UL                                 /**< Bit mask for I2C_RXFULL                     */
#define _I2C_STATUS_RXFULL_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for I2C_STATUS                 */
#define I2C_STATUS_RXFULL_DEFAULT               (_I2C_STATUS_RXFULL_DEFAULT << 9)       /**< Shifted mode DEFAULT for I2C_STATUS         */
#define _I2C_STATUS_TXBUFCNT_SHIFT              10                                      /**< Shift value for I2C_TXBUFCNT                */
#define _I2C_STATUS_TXBUFCNT_MASK               0xC00UL                                 /**< Bit mask for I2C_TXBUFCNT                   */
#define _I2C_STATUS_TXBUFCNT_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for I2C_STATUS                 */
#define I2C_STATUS_TXBUFCNT_DEFAULT             (_I2C_STATUS_TXBUFCNT_DEFAULT << 10)    /**< Shifted mode DEFAULT for I2C_STATUS         */

/* Bit fields for I2C CLKDIV */
#define _I2C_CLKDIV_RESETVALUE                  0x00000000UL                            /**< Default value for I2C_CLKDIV                */
#define _I2C_CLKDIV_MASK                        0x000001FFUL                            /**< Mask for I2C_CLKDIV                         */
#define _I2C_CLKDIV_DIV_SHIFT                   0                                       /**< Shift value for I2C_DIV                     */
#define _I2C_CLKDIV_DIV_MASK                    0x1FFUL                                 /**< Bit mask for I2C_DIV                        */
#define _I2C_CLKDIV_DIV_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for I2C_CLKDIV                 */
#define I2C_CLKDIV_DIV_DEFAULT                  (_I2C_CLKDIV_DIV_DEFAULT << 0)          /**< Shifted mode DEFAULT for I2C_CLKDIV         */

